; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 171730 2 1 4 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	infrared2 - mode
	infrared3 - mode
	spectrograph0 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon3)
)
(:goal (and
	(have_image Phenomenon3 infrared3)
	(have_image Planet4 spectrograph0)
	(have_image Phenomenon5 infrared2)
	(have_image Planet6 infrared2)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 infrared3)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
4. (turn_to satellite1 star1 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
5. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 6
6. (turn_to satellite0 phenomenon3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon3)
   goals met: 0 of 6
7. (turn_to satellite1 star8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
8. (turn_to satellite0 star0 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
9. (take_image satellite1 star8 instrument1 infrared3)
   added: (have_image star8 infrared3)
   goals met: 1 of 6
10. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 6
11. (turn_to satellite1 planet6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet6)
   goals met: 1 of 6
12. (turn_to satellite0 phenomenon3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon3)
   goals met: 1 of 6
13. (take_image satellite1 planet6 instrument1 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 2 of 6
14. (take_image satellite0 phenomenon3 instrument0 infrared3)
   added: (have_image phenomenon3 infrared3)
   goals met: 3 of 6
15. (turn_to satellite1 planet4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet4)
   goals met: 3 of 6
16. (take_image satellite1 planet4 instrument1 spectrograph0)
   added: (have_image planet4 spectrograph0)
   goals met: 4 of 6
17. (turn_to satellite1 phenomenon7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 6
18. (take_image satellite1 phenomenon7 instrument1 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 5 of 6
19. (turn_to satellite1 phenomenon5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 6
20. (take_image satellite1 phenomenon5 instrument1 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 6 of 6
